---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerIterator.Reset
source: html/3e497cae-a95c-ebb7-a4e5-238b471bafc6.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerIterator.Reset Method

Resets the iterator to the initial state.

## Syntax (C#)
```csharp
public virtual void Reset()
```